; domain
(define (domain gripper-strips)
    (:requirements :strips :typing)
  (:types robot room ball gripper - object)
  (:predicates (at-robby ?r - robot ?ro - room)
	       (at ?b - ball ?r - room)
	       (free ?r - robot ?g - gripper)
	       (carry ?b - ball ?g - gripper))

  (:action move
	   :parameters (?r - robot ?from - room ?to - room)
	   :precondition (and (at-robby ?r ?from))
	   :effect (and (at-robby ?r ?to)
			(not (at-robby ?r ?from))))

  (:action pick
	   :parameters (?r - robot ?obj - ball ?room - room ?gripper - gripper)
	   :precondition (and (at ?obj ?room) (at-robby ?r ?room) (free ?r ?gripper))
	   :effect (and (carry ?obj ?gripper)
			(not (at ?obj ?room))
			(not (free ?r ?gripper ))))

  (:action drop
	   :parameters (?r - robot ?obj - ball ?room - room ?gripper - gripper)
	   :precondition (and (carry ?obj ?gripper) (at-robby ?r ?room))
	   :effect (and (at ?obj ?room)
			(free ?r ?gripper)
			(not (carry ?obj ?gripper)))))

; problem
(define (problem gripper-1-5-5)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 - room
ball1 ball2 ball3 ball4 ball5 - ball)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room1)
(at ball2 room2)
(at ball3 room2)
(at ball4 room3)
(at ball5 room4)
)
(:goal
(and
(at ball1 room2)
(at ball2 room3)
(at ball3 room4)
(at ball4 room5)
(at ball5 room1)
)
)
)

; plan
1. (pick robot1 ball1 room1 rgripper1)
   deleted: (at ball1 room1) (free robot1 rgripper1)
   added: (carry ball1 rgripper1)
   goals met: 0 of 5
2. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 0 of 5
3. (pick robot1 ball3 room2 lgripper1)
   deleted: (at ball3 room2) (free robot1 lgripper1)
   added: (carry ball3 lgripper1)
   goals met: 0 of 5
4. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 1 of 5
5. (pick robot1 ball2 room2 rgripper1)
   deleted: (at ball2 room2) (free robot1 rgripper1)
   added: (carry ball2 rgripper1)
   goals met: 1 of 5
6. (move robot1 room2 room4)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room4)
   goals met: 1 of 5
7. (drop robot1 ball3 room4 lgripper1)
   deleted: (carry ball3 lgripper1)
   added: (at ball3 room4) (free robot1 lgripper1)
   goals met: 2 of 5
8. (pick robot1 ball5 room4 lgripper1)
   deleted: (at ball5 room4) (free robot1 lgripper1)
   added: (carry ball5 lgripper1)
   goals met: 2 of 5
9. (move robot1 room4 room3)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room3)
   goals met: 2 of 5
10. (drop robot1 ball2 room3 rgripper1)
   deleted: (carry ball2 rgripper1)
   added: (at ball2 room3) (free robot1 rgripper1)
   goals met: 3 of 5
11. (pick robot1 ball4 room3 rgripper1)
   deleted: (at ball4 room3) (free robot1 rgripper1)
   added: (carry ball4 rgripper1)
   goals met: 3 of 5
12. (move robot1 room3 room5)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room5)
   goals met: 3 of 5
13. (drop robot1 ball4 room5 rgripper1)
   deleted: (carry ball4 rgripper1)
   added: (at ball4 room5) (free robot1 rgripper1)
   goals met: 4 of 5
14. (move robot1 room5 room1)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room1)
   goals met: 4 of 5
15. (drop robot1 ball5 room1 lgripper1)
   deleted: (carry ball5 lgripper1)
   added: (at ball5 room1) (free robot1 lgripper1)
   goals met: 5 of 5
